Смотрю, ты поленился вписать свое имя, поэтому наш фирменный#квантово-хаотичный-мета-нарративный генератор выбрал его за тебя.#Оно тебе очень к лицу, между прочим. >
Привет, эта буква посреди экрана — это я, твой личный инструктор.#Сейчас я тебе расскажу обо всех основах игры.#Они очень сложные, приготовься. >
Механика управления разрабатывалась два года и один день#самым усердными работником, так что у нас все очень серьезно! >
Вот этот зеленый символ на экране - это ты. Не дурно, да?#Но я все равно красивее, уж прости. >
Для перемещения просто используй "wasd" или стрелки на клавиатуре. >
Чтобы открыть инвентарь, нажми i.#(убери палец с кнопки, успеешь ещё)#Только помни, он не безграничен, все добро с собой ты унести не сможешь. >
Но не беспокойся, тебе очень часто на пути будут попадаться торговцы.#Они обычно подсвечены оранжевым цветом, ни с кем не спутаешь.#Можешь продать им любое барахло или купить у них прикольные зелья#— это самое главное, они в разы облегчат тебе путешествие, запомни это. >
В каждой комнате тебя может поджидать сундук#с чем-то интересным или монстр, тут уж как повезет.#Знавал я одного героя, которому жутко не везло.#Если что, он умер прямо во время обучения.#Ты, надеюсь, удачливее будешь. >
А, и еще пара советов. Не хочу, чтобы ты погиб сразу же в третьей комнате. >
Старайся собрать как можно больше денег с каждого этажа и не забывай лечиться.#На каждом этаже тебя ждет босс с очень ценной экипировкой,#поэтому обязательно постарайся его убить. Но и сам смотри не умри. >
Чтобы вступить в схватку с монстром, просто подходи к нему вплотную,#ты заметишь, как он станет подсвечиваться красным#– это значит, что твой урон по нему прошел. >
За убийства и сбор денег ты будешь получать очки,#которые будут повышать твой рейтинг в нашей секретной#бально-рейтинговой таблице всех приключенцев,#которые когда-либо спускались в это подземелье.#Чем больше у тебя очков, тем ты круче - все просто. >
Но можешь не сражаться с монстрами и просто убегать от них.#Только тогда ты прослывешь самым трусливым трусом и никогда не прославишься.#Я таких презираю, если честно, но ты на такого не похож.>
В общем, удачи, дружище, она тебе понадобится! >
А и да, пока не забыл. >
Держи в подарок меч - не голыми же руками драться. > Начать игру
